# Handle missing values in dataset using dropna(),fillna(),interpolate()

In [1]:
#import   libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
dataset=pd.read_excel(r"C:\Users\Pc World Computers\Desktop\Pandas - Complete\students grade.xlsx")
dataset

   Class student Name  Math  English  Science
0      6       hassan  70.0     60.0     40.0
1      6        noman  60.0     50.0      NaN
2      6        reema  80.0      0.0     50.0
3      7         taha   NaN     80.0     70.0
4      7        ashal  90.0      NaN     99.0
5      7     shumaila   NaN      NaN     93.0
6      9         rohi  99.0    100.0      NaN
7      9         noor  89.0      NaN     73.0
8     10     alam jan  67.0     72.0    100.0
9     10    noor deen   NaN     85.0     42.0

In [3]:
# checking the shape of the data set
dataset.shape

(10, 5)

In [4]:
# data types of the data set
dataset.dtypes

Class             int64
student Name     object
Math            float64
English         float64
Science         float64
dtype: object

In [5]:
# details about the dataset
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Class         10 non-null     int64
 1   student Name  10 non-null     object
 2   Math          7 non-null      float64
 3   English       7 non-null      float64
 4   Science       8 non-null      float64
dtypes: float64(3), int64(1), object(1)
memory usage: 528.0+ bytes

In [6]:
#checking the null/missing values in dataset
dataset.isnull().sum()

Class           0
student Name    0
Math            3
English         3
Science         2
dtype: int64

#### There are multiple ways to deal with missing values. At first, we will create a copy of the dataset and then we will use *dropna()*

### dropna() is used to drop all the values in the columns that has missing or nan values

# dropna() - drop all the rows with missing values

In [7]:
# first we will create the copy of the dataset
dataset_copy1 = dataset.copy()

In [8]:
dataset_copy1.head()

   Class student Name  Math  English  Science
0      6       hassan  70.0     60.0     40.0
1      6        noman  60.0     50.0      NaN
2      6        reema  80.0      0.0     50.0
3      7         taha   NaN     80.0     70.0
4      7        ashal  90.0      NaN     99.0

In [9]:
# dropping all the rows with missing values
dataset_copy1.dropna(inplace=True)

All the rows with missing values has been removed

In [10]:
dataset_copy1.isnull().sum()

Class           0
student Name    0
Math            0
English         0
Science         0
dtype: int64

In [11]:
dataset_copy1

   Class student Name  Math  English  Science
0      6       hassan  70.0     60.0     40.0
2      6        reema  80.0      0.0     50.0
8     10     alam jan  67.0     72.0    100.0

In [12]:
dataset_copy1.shape

(3, 5)

In [13]:
# we will export this dataset in excel
dataset_copy1.to_excel("Handle Missing values with dropna.xlsx")

This method is handy for large dataset,In the smaller dataset this function is not very useful. It will drop all the values that has missing or nan values. There are other better options we could use on smaller dataset like fillna(),interpolate()

# fillna()

### fillna() is used for handling missing values or nan values in the column

#### We can use fillna() for handling numercial missing data with different techniques like by putting average values(mean),median,mode etc.

In [14]:
# creating a  copy of the dataset
dataset_copy2 = dataset.copy()

In [15]:
dataset_copy2

   Class student Name  Math  English  Science
0      6       hassan  70.0     60.0     40.0
1      6        noman  60.0     50.0      NaN
2      6        reema  80.0      0.0     50.0
3      7         taha   NaN     80.0     70.0
4      7        ashal  90.0      NaN     99.0
5      7     shumaila   NaN      NaN     93.0
6      9         rohi  99.0    100.0      NaN
7      9         noor  89.0      NaN     73.0
8     10     alam jan  67.0     72.0    100.0
9     10    noor deen   NaN     85.0     42.0

Handle missing value with **fillna()** by average value(mean)

In [16]:
dataset_copy2["Math"].fillna(dataset_copy2["Math"].mean(),inplace=True)

In [17]:
dataset_copy2["English"].fillna(dataset_copy2["English"].mean(),inplace=True)

In [18]:
dataset_copy2["Science"].fillna(dataset_copy2["Science"].mean(),inplace=True)

In [19]:
dataset_copy2.isnull().sum()

Class           0
student Name    0
Math            0
English         0
Science         0
dtype: int64

Data is clean now with inseting average values

In [20]:
dataset_copy2

   Class student Name       Math     English  Science
0      6       hassan  70.000000   60.000000   40.000
1      6        noman  60.000000   50.000000   70.875
2      6        reema  80.000000    0.000000   50.000
3      7         taha  79.285714   80.000000   70.000
4      7        ashal  90.000000   63.857143   99.000
5      7     shumaila  79.285714   63.857143   93.000
6      9         rohi  99.000000  100.000000   70.875
7      9         noor  89.000000   63.857143   73.000
8     10     alam jan  67.000000   72.000000  100.000
9     10    noor deen  79.285714   85.000000   42.000

In [21]:
#checking the data type
dataset_copy2.dtypes

Class             int64
student Name     object
Math            float64
English         float64
Science         float64
dtype: object

In [22]:
# converting the datatype to int of columns: Math,English,Science
dataset_copy2[["Math","English","Science"]] = dataset_copy2[["Math","English","Science"]].astype('int64')

In [23]:
# checking the datatype after manipulation
dataset_copy2.dtypes

Class            int64
student Name    object
Math             int64
English          int64
Science          int64
dtype: object

In [24]:
dataset_copy2

   Class student Name  Math  English  Science
0      6       hassan    70       60       40
1      6        noman    60       50       70
2      6        reema    80        0       50
3      7         taha    79       80       70
4      7        ashal    90       63       99
5      7     shumaila    79       63       93
6      9         rohi    99      100       70
7      9         noor    89       63       73
8     10     alam jan    67       72      100
9     10    noor deen    79       85       42

In [25]:
# exporting the dataset manipulated by fillna() with average value
dataset_copy2.to_csv("Handle missing data with fillan(mean()).csv")

# fillna() - method=bfill/pad,ffill - limit=1 (could be 1,2,3)

In [26]:
# making a duplicate  of the original dataset
dataset_copy3 = dataset.copy()

In [27]:
dataset_copy3.shape

(10, 5)

In [28]:
dataset_copy3.isnull().sum()

Class           0
student Name    0
Math            3
English         3
Science         2
dtype: int64

handle missing data with forward or backward values present in the dataset.

In [29]:
dataset_copy3

   Class student Name  Math  English  Science
0      6       hassan  70.0     60.0     40.0
1      6        noman  60.0     50.0      NaN
2      6        reema  80.0      0.0     50.0
3      7         taha   NaN     80.0     70.0
4      7        ashal  90.0      NaN     99.0
5      7     shumaila   NaN      NaN     93.0
6      9         rohi  99.0    100.0      NaN
7      9         noor  89.0      NaN     73.0
8     10     alam jan  67.0     72.0    100.0
9     10    noor deen   NaN     85.0     42.0

In [30]:
dataset_copy3.ffill(limit=2,inplace=True) # limit means it can only fill the value in next 2 columns

#### The data is handled by ffill - forward fill which insert the row 3  value to row 4,5  in the next column

## Same could be done using bfill or pad - dataset_copy3.bfill()

In [41]:
dataset_copy3

      student Name  Math  English  Science
Class
6           hassan  70.0     60.0     40.0
6            noman  60.0     50.0     40.0
6            reema  80.0      0.0     50.0
7             taha  80.0     80.0     70.0
7            ashal  90.0     80.0     99.0
7         shumaila  90.0     80.0     93.0
9             rohi  99.0    100.0     93.0
9             noor  89.0    100.0     73.0
10        alam jan  67.0     72.0    100.0
10       noor deen  67.0     85.0     42.0

In [45]:
# exporting the dataset into excel
dataset_copy3.to_excel("fillna with ffill,limit.xlsx")

### handling missing values with dictionary

In [47]:
# creating a copy of the original dataset
dataset_copy4 = dataset.copy()

In [49]:
dataset_copy4.isnull().sum()

Class           0
student Name    0
Math            3
English         3
Science         2
dtype: int64

In [50]:
# handle missing data in dictionary 
dataset_copy4.fillna({
    'Math': 50,
    'Science':50,
    'English':50
},inplace=True)

In [52]:
dataset_copy4.isnull().sum()

Class           0
student Name    0
Math            0
English         0
Science         0
dtype: int64

In [53]:
# creating a copy of the dataset
dataset_copy4.to_excel("fillna with dictionary.xlsx")

# interpolate()

### --- interpolate() is used different methods to insert value in the missing columns by default its method is linear, it could be time, nearest,bfill,ffill,pad etc

> for example, row 5 is nan/missing and we want a value in it. Then we could use  interpolate() to insert values, by default linear method it will add the average value of row 6 and row 4 to the missing field. By time method it will use the neares time,date etc.

In [54]:
# creating a copy of the original dataset
dataset_copy5 = dataset.copy()

In [55]:
dataset_copy5.isnull().sum()

Class           0
student Name    0
Math            3
English         3
Science         2
dtype: int64

In [66]:
# Now we are going to handle these values by interpolate()  with linear method.
dataset_copy5.interpolate(inplace=True) # linear is used for continous values time works well on date

In [67]:
dataset_copy5

   Class student Name  Math     English  Science
0      6       hassan  70.0   60.000000     40.0
1      6        noman  60.0   50.000000     45.0
2      6        reema  80.0    0.000000     50.0
3      7         taha  85.0   80.000000     70.0
4      7        ashal  90.0   86.666667     99.0
5      7     shumaila  94.5   93.333333     93.0
6      9         rohi  99.0  100.000000     83.0
7      9         noor  89.0   86.000000     73.0
8     10     alam jan  67.0   72.000000    100.0
9     10    noor deen  67.0   85.000000     42.0

In [68]:
dataset_copy5.to_excel('interpolate.xlsx')